#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "vegero-tg-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + registry_id = (known after apply)
  + repo_name   = "vegero-tg-ecr"
  + repo_url    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
data.aws_availability_zones.available: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
data.aws_availability_zones.available: Read complete after 0s [id=eu-north-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 0
      + tags              = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-VPC-eu-north-1a"
        }
      + tags_all             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-VPC-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc                  = true
    }

  # module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                 = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "vpc-flow-log-to-cloudwatch-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all    = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-VPC"
        }
      + tags_all = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-VPC"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-VPC-eu-north-1a"
        }
      + tags_all             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-VPC-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-VPC-private"
        }
      + tags_all         = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-VPC-private"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-VPC-public"
        }
      + tags_all         = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-VPC-public"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-private-eu-north-1a"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                       = "Terraform"
          + "DeploymentPrefix"                 = "vegero-eks"
          + "Environment"                      = "Development"
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-private-eu-north-1a"
          + "OwnerEmail"                       = "devops@example.com"
          + "Team"                             = "DevOps"
          + "TerminationDate"                  = "Permanent"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-private-eu-north-1b"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                       = "Terraform"
          + "DeploymentPrefix"                 = "vegero-eks"
          + "Environment"                      = "Development"
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-private-eu-north-1b"
          + "OwnerEmail"                       = "devops@example.com"
          + "Team"                             = "DevOps"
          + "TerminationDate"                  = "Permanent"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-private-eu-north-1c"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                       = "Terraform"
          + "DeploymentPrefix"                 = "vegero-eks"
          + "Environment"                      = "Development"
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-private-eu-north-1c"
          + "OwnerEmail"                       = "devops@example.com"
          + "Team"                             = "DevOps"
          + "TerminationDate"                  = "Permanent"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-public-eu-north-1a"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                       = "Terraform"
          + "DeploymentPrefix"                 = "vegero-eks"
          + "Environment"                      = "Development"
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-public-eu-north-1a"
          + "OwnerEmail"                       = "devops@example.com"
          + "Team"                             = "DevOps"
          + "TerminationDate"                  = "Permanent"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-public-eu-north-1b"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                       = "Terraform"
          + "DeploymentPrefix"                 = "vegero-eks"
          + "Environment"                      = "Development"
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-public-eu-north-1b"
          + "OwnerEmail"                       = "devops@example.com"
          + "Team"                             = "DevOps"
          + "TerminationDate"                  = "Permanent"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-public-eu-north-1c"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                       = "Terraform"
          + "DeploymentPrefix"                 = "vegero-eks"
          + "Environment"                      = "Development"
          + "Example"                          = "vegero-eks-additional"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-VPC-public-eu-north-1c"
          + "OwnerEmail"                       = "devops@example.com"
          + "Team"                             = "DevOps"
          + "TerminationDate"                  = "Permanent"
          + "kubernetes.io/cluster/vegero-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-VPC"
        }
      + tags_all                             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-VPC"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnets = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr_block  = "10.0.0.0/16"
  + vpc_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.additional will be created
  + resource "aws_security_group" "additional" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                  + "172.16.0.0/12",
                  + "192.168.0.0/16",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "vegero-eks-additional"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "vegero-eks-additional"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks-additional"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = "vpc-fake-id"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sg_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
module.eks.module.eks_managed_node_group["blue"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["blue"].data.aws_partition.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["blue"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["blue"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["blue"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["blue"].data.aws_caller_identity.current: Read complete after 0s [id=178112661675]
module.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Read complete after 0s [id=178112661675]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "EKS Secret Encryption Key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                           = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/vegero-eks/cluster"
      + retention_in_days = 90
      + tags              = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Example"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Example"
      + resource_id = (known after apply)
      + value       = "vegero-eks"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["GithubOrg"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubOrg"
      + resource_id = (known after apply)
      + value       = "terraform-aws-modules"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["GithubRepo"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubRepo"
      + resource_id = (known after apply)
      + value       = "terraform-aws-eks"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "coredns"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "vegero-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name    = "kube-proxy"
      + addon_version = (known after apply)
      + arn           = (known after apply)
      + cluster_name  = "vegero-eks"
      + created_at    = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + tags          = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all      = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "vpc-cni"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "vegero-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "vegero-eks"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                  = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + version                   = (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-fake-ids",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-eks-irsa"
        }
      + tags_all        = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-eks-irsa"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "vegero-eks-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all    = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vegero-eks-cluster-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "vegero-eks-cluster"
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "vegero-eks-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "vegero-eks-cluster"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "vegero-eks-cluster"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = "vpc-fake-id"
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "vegero-eks-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"                          = "vegero-eks"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-node"
          + "kubernetes.io/cluster/vegero-eks" = "owned"
        }
      + tags_all               = {
          + "DeployedBy"                       = "Terraform"
          + "DeploymentPrefix"                 = "vegero-eks"
          + "Environment"                      = "Development"
          + "Example"                          = "vegero-eks"
          + "GithubOrg"                        = "terraform-aws-modules"
          + "GithubRepo"                       = "terraform-aws-eks"
          + "Name"                             = "vegero-eks-node"
          + "OwnerEmail"                       = "devops@example.com"
          + "Team"                             = "DevOps"
          + "TerminationDate"                  = "Permanent"
          + "kubernetes.io/cluster/vegero-eks" = "owned"
        }
      + vpc_id                 = "vpc-fake-id"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "To node 1025-65535"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Node all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node all ports/protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "vegero-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
          + "t3.small",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "blue-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-fake-ids",
        ]
      + tags                   = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "blue"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "blue"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "blue-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for blue EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "blue-"
      + tags                   = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Example"    = "vegero-eks"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "blue"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Example"    = "vegero-eks"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "blue"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Example"    = "vegero-eks"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "blue"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "EKS managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "blue-eks-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "blue-eks-node-group"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "blue-eks-node-group"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = "vpc-fake-id"
    }

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "vegero-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "green-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-fake-ids",
        ]
      + tags                   = {
          + "Example"    = "vegero-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "green"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "green"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + taint {
          + effect = "NO_SCHEDULE"
          + key    = "dedicated"
          + value  = "gpuGroup"
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 50
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "green-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "vegero-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for green EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "green-"
      + tags                   = {
          + "Example"    = "vegero-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Example"    = "vegero-eks"
              + "ExtraTag"   = "example"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "green"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Example"    = "vegero-eks"
              + "ExtraTag"   = "example"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "green"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Example"    = "vegero-eks"
              + "ExtraTag"   = "example"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "green"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "EKS managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "green-eks-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "vegero-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "green-eks-node-group"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "green-eks-node-group"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = "vpc-fake-id"
    }

Plan: 47 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_id = (known after apply)

Warning: Redundant ignore_changes element

  on .terraform/modules/eks/main.tf line 305, in resource "aws_eks_addon" "this":
 305: resource "aws_eks_addon" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute modified_at is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: 4fee0f6434056531f3d0c18d62d7795e1b8f216f

*Pusher: @vvvegero97, Action: `pull_request`, Working Directory: `terragrunt_way`, Workflow: `Terragrunt CI/CD Pipeline`*